{
    "work": [
        {
            "id": 1,
            "title": "KESAN-IDEA",
            "about": "Kansei Engineering-based System for Agroindustry (KESAN) is a platform dedicated to help users develop and track individual ideas and overall to boost creativity in Indonesia. While there are a lot of creative people within our country, brilliant ideas tend to get lost or forgotten despite their beneficial potential. KESAN-IDEA exsits to ensure that ideas do not vanish and are kept track for further developments and birth of other related ideas.",
            "ss": ["/assets/umkmass/ss1.png", "/assets/umkmass/ss2.png", "/assets/umkmass/ss3.png", "/assets/umkmass/ss4.png", "/assets/umkmass/ss5.png", "/assets/umkmass/ss6.png", "/assets/umkmass/ss7.png", "/assets/umkmass/ss8.png", "/assets/umkmass/ss9.png", "/assets/umkmass/ss10.png"],
            "role": "Full-stack Developer",
            "start": "06/23",
            "end": "12/23",
            "members": ["Naufal Abiyyu", "Muhammad Rifqi Fameizy"],
            "overview": ["Full-stack Development", "Project Management"],
            "link": "https://idea-generator-dev.web.app/",
            "clg": "As a research project with high functional complexity, it was challenging at first for us to set up the backend and database, as well as the skeleton structure of the frontend. Additionally, as a project with high demand for students and researchers, constant updates were required within a narrow timespan, therefore, time was one of the main issues considering classworks and exams.",
            "stack": ["React.js", "ChakraUI", "Axios API", "JavaScript", "Python", "Firebase"]
        },
        {
            "id": 2,
            "title": "MyRoute",
            "about": "MyRoute is a social media platform designed specifically for runners. Users are able to join others by joining routes set by other users. By gathering in a group, users are able to communicate with others via text, and later meet up and run together. This application was designed so that runners are able to socialize with others, partake in challenges or marathons together, and track individual performances through the app.",
            "ss": ["/assets/figmass/ss1.png", "/assets/figmass/ss2.png", "/assets/figmass/ss3.png", "/assets/figmass/ss4.png"],
            "role": "UI/UX Designer",
            "start": "11/22",
            "end": "01/23",
            "members": ["Naufal Abiyyu"],
            "overview": ["UI/UX", "Mobile Application"],
            "clg": "As the project was then required to use Flutter, which was a language I was unfamiliar of, I had issues with the overall syntax and structure of the project. Therefore, development was terminated and left with only the UI/UX design of the mobile application.",
            "stack": ["Figma"]
        },
        {
            "id": 3,
            "title": "PEMIRA",
            "about": "Pemilihan Raya HIMAKOM was an election website for the new head of our organization, Himpunan Mahasiswa Ilmu Komputer (Computer Science Student Organization). The project was carried out with a team, marking a personal milestone of working as a team for the first time. This website was developed as a mean for students within our organization to vote for the new head of our organization, integrating both frontend and backend, storing all votes within our database, and showing the progress of the election by bars.",
            "ss": ["/assets/pemirass/ss1.png", "/assets/pemirass/ss2.png", "/assets/pemirass/ss3.png", "/assets/pemirass/ss4.png", "/assets/pemirass/ss5.png", "/assets/pemirass/ss6.png", "/assets/pemirass/ss7.png", "/assets/pemirass/ss8.png", "/assets/pemirass/ss9.png"],
            "role": "Front-end Developer",
            "start": "10/22",
            "end": "12/22",            
            "members": ["Naufal Abiyyu"],
            "overview": ["Frontend Development", "UI/UX", "Dynamic Website"],
            "clg": "Due to design complexity as an early frontend developer at that time, I found it quite difficult to implement the designs, ensuring responsiveness and dynamic web.",
            "stack": ["React.js", "TailwindCSS", "Axios API", "JavaScript"]
        }
    ]
}